## Plan Result (environments/production)
- [CI link](https://github.com/jinugasachio/advanced-ecs-on-fargate/actions/runs/1676690342)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_vpc.main


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                            = (known after apply)
      + cidr_block                     = "10.0.0.0/16"
      + default_network_acl_id         = (known after apply)
      + default_route_table_id         = (known after apply)
      + default_security_group_id      = (known after apply)
      + dhcp_options_id                = (known after apply)
      + enable_classiclink             = (known after apply)
      + enable_classiclink_dns_support = (known after apply)
      + enable_dns_hostnames           = (known after apply)
      + enable_dns_support             = true
      + id                             = (known after apply)
      + instance_tenancy               = "default"
      + ipv6_association_id            = (known after apply)
      + ipv6_cidr_block                = (known after apply)
      + main_route_table_id            = (known after apply)
      + owner_id                       = (known after apply)
      + tags_all                       = {
          + "Environments" = "production"
          + "Terraform"    = "true"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"run-terragrunt-plan","PRNumber":99,"Program":"tfcmt","SHA1":"056baf8ffcc179f1409531fd55779b6ea5357337","Target":"environments/production","Vars":{},"WorkflowName":"Terragrunt workflow"} -->